app/views/annonces/index.html.erb

    <% if current_user %>
      <% @annonces = Annonce.where(user_id: current_user.id) %>
---
SELECT "annonces".* FROM "annonces" WHERE "annonces"."user_id" = ?  [["user_id", 4]]