app/controllers/annonces_controller.rb

SELECT "annonces".* FROM "annonces"
---
  def index
    @annonces = Annonce.all

INSERT INTO "annonces" ("urlRecherche", "created_at", "updated_at") VALUES (?, ?, ?)  [["urlRecherche", "http://www.leboncoin.fr/offres_d_emploi/offres/bourgogne/?f=a&th=1&location="], ["created_at", "2015-05-18 09:31:29.885291"], ["updated_at", "2015-05-18 09:31:29.885291"]]
---
  def create
    @titre = params["titre"]
    @typeProduit = params["typeProduit"]
    @region = params["region"]
    @codePostal = params["codePostal"]
    @url = "http://www.leboncoin.fr/#{@typeProduit.downcase}/offres/#{@region.downcase}/?f=a&th=1&q=#{@titre.downcase}&location=#{@codePostal}"
    @newAnnonce = {
      :titre => params["annonce"]["titre"],
      :urlRecherche => @url
    }
    @annonce = Annonce.new(@newAnnonce)
    respond_to do |format|
      if @annonce.save

UPDATE "annonces" SET "titre" = ?, "urlRecherche" = ?, "updated_at" = ? WHERE "annonces"."id" = ?  [["titre", "gfhjkl"], ["urlRecherche", "http://www.leboncoin.fr/voitures/offres/aquitaine/?f=a&th=1&location=33300"], ["updated_at", "2015-05-18 09:35:54.406229"], ["id", 69]]
---
  def update
    @titre = params["titre"]
    @typeProduit = params["typeProduit"]
    @region = params["region"]
    @codePostal = params["codePostal"]
    @url = "http://www.leboncoin.fr/#{@typeProduit.downcase}/offres/#{@region.downcase}/?f=a&th=1&q=#{@titre}&location=#{@codePostal}"
    @updatedAnnonce = {
      :titre => params["annonce"]["titre"],
      :urlRecherche => @url
    }
    respond_to do |format|
      if @annonce.update(@updatedAnnonce)

DELETE FROM "annonces" WHERE "annonces"."id" = ?  [["id", 60]]
---
  def destroy
    @annonce.destroy

SELECT  "annonces".* FROM "annonces" WHERE "annonces"."id" = ? LIMIT 1  [["id", 69]]
---
    def set_annonce
      @annonce = Annonce.find(params[:id])