app/controllers/welcome_controller.rb

  def index
  	if user_signed_in?
	  	@annonces = Annonce.all
---
SELECT "annonces".* FROM "annonces"